{
    "notifications": [
        {
            "id": 1,
            "type": "new_message",
            "message_id": "1743582645284",
            "message": "New emails arrived! You have new messages from LinkedIn, Sarah Anderson, and GitBook. Reply to Sarah's email about Partnership Question and book a time to chat with her.",
            "timestamp": "2025-04-02T08:30:45.284980Z"
        },
        {
            "id": 2,
            "type": "new_message",
            "message_id": "1743582649725",
            "message": "Hey! I've got some fresh news for you. Check out what's trending - CNN, Fox News, and The Washington Post are leading the way with in-depth coverage of U.S. & world news, entertainment, health, business, tech, politics, sports, and more. Plus, get breaking news from Yahoo News, AP, and other top sources.",
            "timestamp": "2025-04-02T08:30:49.725142Z"
        },
        {
            "id": 3,
            "type": "new_message",
            "message_id": "1743583477842",
            "message": "Check out these awesome articles if you're interested in staying up-to-date with the latest tech news! From Reuters to TechNewsWorld, we've got you covered with the best sources for technology insights and analysis.",
            "timestamp": "2025-04-02T08:44:37.842319Z"
        },
        {
            "id": 4,
            "type": "new_message",
            "message_id": "1743584091954",
            "message": "Check out these fresh insights! We've got a treasure trove of articles about innovation, digital transformation, and more at sites like digitalleadership.com, innovationnewsnetwork.com, and idea-scale.com. Dive into expert advice and cutting-edge news on the latest tech innovations and trends in science, research, and e-mobility. And if you're looking to boost your ideation skills, WIP's blog has got you covered with manager's guides to ideation techniques.",
            "timestamp": "2025-04-02T08:54:51.954772Z"
        },
        {
            "id": 5,
            "type": "new_message",
            "message_id": "1743584437374",
            "message": "Hey there! I've got some exciting updates for you! NASA's latest news releases reveal a lot of promising developments in space exploration, including their ambitious plans to explore the solar system and the recent historic spaceflight by SpaceX. There are also some fascinating studies on analyzing online news sources that might interest you.",
            "timestamp": "2025-04-02T09:00:37.374406Z"
        },
        {
            "id": 6,
            "type": "new_message",
            "message_id": "1743584619288",
            "message": "Stay curious and informed! Check out these recent articles that might interest you: Google explains how its search function works, CNN offers comprehensive coverage of French politics, and Vox provides clear explanations of complex issues through their Explained podcast.",
            "timestamp": "2025-04-02T09:03:39.288675Z"
        },
        {
            "id": 7,
            "type": "new_message",
            "message_id": "1743584729499",
            "message": "Hey there! Just got some exciting updates on the latest tech innovations. From AI breakthroughs to cryptocurrency advancements, it looks like we're on the cusp of some major changes. Want to check out what's new? I've curated a list of articles from reputable sources like Interesting Engineering and WIRED that dive into the world of innovation. Which area sparks your interest?",
            "timestamp": "2025-04-02T09:05:29.499189Z"
        },
        {
            "id": 8,
            "type": "new_message",
            "message_id": "1743585239287",
            "message": "Check out the latest breakthroughs in space exploration! NASA has just released its roadmap for a solar system exploration mission, and scientists are making waves with discoveries like Reionization and Ices Explorer phenomena. From Live Science to Space.com, we've got you covered with all the hottest updates.",
            "timestamp": "2025-04-02T09:13:59.287246Z"
        },
        {
            "id": 9,
            "type": "new_message",
            "message_id": "1743585457050",
            "message": "Did you know that a fundamental idea called 'underlying principle' has roots in linguistics, international business, and even affects politicians like Clinton & Trump? It's also connected to business ethics & cancer research! Want to learn more about its applications across various fields?",
            "timestamp": "2025-04-02T09:17:37.050422Z"
        }
    ],
    "next_notification_id": 10
}